{
  "architectures": [
    "OlmoeForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "clip_qkv": null,
  "eos_token_id": 50279,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "max_position_embeddings": 4096,
  "model_type": "olmoe",
  "norm_topk_prob": false,
  "num_attention_heads": 16,
  "num_experts": 64,
  "num_experts_per_tok": 8,
  "num_hidden_layers": 16,
  "num_key_value_heads": 16,
  "output_router_logits": false,
  "pad_token_id": 1,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "router_aux_loss_coef": 0.01,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.43.0.dev0",
  "use_cache": true,
  "vocab_size": 50304
}
